"use strict"
// Цикли
//while - спочатку думаємо - потім робимо
/*let i = 0;
while (i < 10) {
    console.log('i=' + i++);
}*/

// Пару слів про "локальні" змінні
/*let local = "Зовнішня змінна";
var i = 5;
while (i) {
    i--;
    let local = "внутрішня змінна";
    console.log("всередині циклу local=\"" + local + "\"");
}
console.log("Після закінчення циклу i =" + i);
console.log("А змінна local=\"" + local + "\"");*/

//Цикл while може закінчитися, так і не розпочавшись
/*while(false){
    console.log('А я все одно щось зроблю ?');
}
console.log('Кінець завдання');*/

//А може й затягнутися (не треба так робити)
/*while(true){
	console.log('А я все одно щось зроблю');
}
console.log('Кінець завдання');*/

//do...while - спочатку робимо, потім думаємо
/*
let i = 0;
do {
    i += 2;
    console.log("i=" + i);
} while (i < 5);
console.log("Після закінчення циклу i =" + i);*/

// do...while обов'язково відпрацює хоча б раз!
/*do{
    console.log("А я все одно щось зроблю");
}while(false);*/

// Цикл For
// Класика
/*for (var i = 0; i < 10; i++) {
    console.log('лічильник циклу i= ' + i);
}
console.log("Після закінчення циклу i = " + i);*/

//Секції в оголошенні циклу можна використовувати по-різному
/*var j;
for (var i = 10, j = "hello"; i > 0; j += "+") {
    console.log('Зворотній відлік. лічильник циклу i=' + i);
    i -= 3;
}
console.log("Після закінчення циклу i = " + i);
console.log("Після закінчення циклу j = " + j);*/

//Вот тут нам стане у пригоді локальна зміна:
/*for (let x = 0; x < 5; x++) {
    console.log("Усередині циклу x =" + x);
}
console.log("А зовні x=" + x);*/

//break, continue - ручне керування циклом
/*var i = 0;
for (; ;) {
    if (i == 7) {
        console.log("Дійшли до сімки");
        break;
    }
    i++;
}
console.log("Після закінчення циклу i =" + i);*/

// Можна і так
/*for (let i = 5; i--;){
    console.log(i); // Так, а чому 4 ?
}*/

// continue – пропускаємо хід. Виводимо лише парні
/*for (let x = 0; x < 10; x++) {
    if (x % 2) continue;
    console.log('тільки парні: х = ' + x);
}
console.log("Як це ще може виглядати")
for (let x = 0; x < 10; x++) {
    if (x % 2 === 0) console.log('тільки парні: х = ' + x);

}*/

//Цікаво, а що буде якщо ми покладемо один for, до іншого!
// Уявімо що ми хочемо створити таблицю множення на 5
/*let number = 5;
for (let i = 1; i <= 9; i++){
    console.log("Результат множення " + number + " * " + i + " = " + number * i);
}*/

// Тепер я хочу зробити всю таблицю множення
/*
for (let i = 1; i <= 9; i++){
    for (let j = 1; j <= 9; j++){
        console.log("Результат множення " + i + " * " + j + " = " + i * j);
    }
    console.log("----------------------------")
}
*/

// А якщо я хочу множити тільки парне значення
/*for (let i = 1; i <= 9; i++){
    if (i % 2) continue;
    for (let j = 1; j <= 9; j++){
        console.log("Результат множення " + i + " * " + j + " = " + i * j);
    }
    console.log("----------------------------")
}*/

//Мітки для циклів
/*label: for (let i = 1; i <= 9; i++) {
    for (let j = 1; j <= 9; j++) {
        if (j === 5) {
            console.log("----------------------------")
            continue label;
        }
        console.log("Результат множення " + i + " * " + j + " = " + i * j);
    }
}*/

/*label: for (let i = 1; i <= 9; i++) {
    for (let j = 1; j <= 9; j++) {
        if (j === 5) {
            break label;
        }
        console.log("Результат множення " + i + " * " + j + " = " + i * j);
    }
    console.log("----------------------------")
}*/

