/*
Завдання 1. Знижка при оплаті
Складність: Легка

Опис задачі:

Напишіть програму, яка приймає температуру і визначає, чи є погода теплою, прохолодною або холодною.

Вимоги:

Створіть змінну, яка буде приймати число, яке представляє температуру в градусах Цельсія.
Використовуючи конструкцію if/else, визначте категорію температури:
Тепла (вище 20 градусів) - вивести повідомлення “На вулиці тепло”
Прохолодна (від 10 до 20 градусів включно) - вивести повідомлення “На вулиці прохолодно”
Холодна (нижче 10 градусів) - вивести повідомлення “На вулиці холодно”
*/

let temperature = 23;

if (temperature > 20) {
    console.log("It is warm on the street");
} else if (temperature >= 10 || temperature <= 20) {
    console.log("It is a bit cold on the street");
} else {
    console.log("It is cold on the street");
}
