/**
 Опис задачі:

 Напишіть програму, яка приймає температуру і визначає, чи є погода теплою, прохолодною або холодною.

 Вимоги:

 1. Створіть змінну, яка буде приймати число, яке представляє температуру в градусах Цельсія.
 2. Використовуючи конструкцію if/else, визначте категорію температури:
 - Тепла (вище 20 градусів) - вивести повідомлення “На вулиці тепло”
 - Прохолодна (від 10 до 20 градусів включно) - вивести повідомлення “На вулиці прохолодно”
 - Холодна (нижче 10 градусів) - вивести повідомлення “На вулиці холодно”
 */

// Варіант 1
const temp = 15;

if (typeof temp !== "number" || isNaN(temp)) {
    console.log("Помилка: введене значення не є числом");
} else if (temp > 20) {
    console.log("На вулиці тепло");
} else if (temp >= 10) {
    console.log("На вулиці прохолодно");
} else {
    console.log("На вулиці холодно");
}

// Варіант 2

/*const temp = 15;

if (typeof temp !== "number" || isNaN(temp)) {
    console.log("Помилка: введене значення не є числом або некоректне");
} else if (temp > 20) {
    console.log("На вулиці тепло");
} else if (temp >= 10 && temp <= 20) {
    console.log("На вулиці прохолодно");
} else  if (temp < 10 ){
    console.log("На вулиці холодно");
} else {
    console.log("Щось не то")
}*/
