//"use strict"

// коментарі, почнемо з них! Це однорядковий коментар

/*    Це багаторядковий коментар.
   Він може розтягуватися на декілька рядків.
   Тут можна додавати більше пояснень. */



//Змінна - це іменована область пам'яті, ім'я якої можна використовувати для здійснення доступу до даних.
// Дані знаходяться у змінній.

/*let message; //Об'ява змінної "age"
message = 'Hello world'; //Ініціалізація змінної значенням "Hello world"
console.log(message) // Вивід зміної в консоль*/

// Найчастіше використовують так
// let message = "Hello world"; //  Об'ява та ініціалізація змінної

// А ще можна ось так
//let a = 5, b = "qwerty", c = 1.2;


// Значення змінної можна змінити
/*let message = "Hillel QA pro";
console.log(message);
message = "JavaScript";
console.log(message);*/

/**
 Декілька важливих правил при виборі імені змінної:
 - Імена змінних повинні бути описовими: Вибирайте імена, які відображають призначення змінної. Читаючи ім'я змінної, інші розробники повинні зрозуміти, що саме вона зберігає.
 - Використовуйте зрозумілі слова: Використовуйте розумілі та логічні слова в іменах змінних. Наприклад, userName для зберігання імені користувача.
 - Уникайте скорочень: Уникайте скорочень та абревіатур, які можуть бути неочевидними для інших. Наприклад, використовуйте numberOfItems замість numItems.
 */

//let age = 18;

/**
 У імені змінної є декілька обмежень:
 - цифри на початку
 - пробіли в назві
 - зарезервовані слова - this, return і так далі
 */

//let 1login='Вася';
//let log-in='Вася';
//let return='повернення'; // зарезервоване слово!

// А ось так вже можна.
/*
let login='vasja';
let log_in='vasja';
let login123='vasja';
let $='дивна зміна';
let _='А чому ні?';
let імя='можливо навіть так, але це погана практика і використовуємо тільки англійську мову';
console.log(імя);*/

// Для створення імені змінної більше ніж одне слово використовувайте:
/*let newMessage;
let new_message;*/

// Регістр має значення !
/*let login;
Login='Вася';*/ // Помилка, Login та login різні зміні.

/**
 Константи - це змінні, значення яких не може бути змінено після їхньої ініціалізації.
 Іншими словами, коли ви визначаєте константу, ви призначаєте їй значення один раз,
 і після цього ви не можете змінити це значення протягом виконання програми.
 */

/*
const salary = 1500;
salary = 2000;
*/

/**
 Ключове слово var є традиційним способом оголошення змінних.
 Змінні, оголошені за допомогою var, доступні в межах функції, в якій вони оголошені, або глобально, якщо оголошені поза функцією.
 Так само var дозволяє перепризначати та повторно оголошувати змінні в тій же області видимості,
 що при необережному використанні може призвести до несподіваної поведінки, тобто змінні, оголошені за допомогою var, мають або функціональну область видимості.
 Вони видимі за межами блоку.
 */

/*var age = 18;
console.log(age);*/

/**
 підняття" або "вспливання" (hoisting) змінних та функцій у JavaScript.
 Це важлива концепція, яка впливає на те, як інтерпретатор JavaScript обробляє оголошення змінних та функцій під час виконання коду.
 */

/*console.log(message); // Дуже цікаво, ніяких помилок.
var message = "QA pro";*/

// Новинки, які вже зовсім не новинки. Підняття на відмінно від var не відбувається
/*console.log(PI) //  Cannot access 'PI' before initialization
const PI = 3.14; // А ось вже нормальний спосіб створення константи*/

/*console.log(name) //  Cannot access 'PI' before initialization
let name = "Alex"; // Інший спосіб створення змінної.*/

/**
 Типи даних
 - Number (Число): Відповідає числовим значенням, включаючи цілі числа та числа з плаваючою комою.
 - String (Рядок): Відповідає послідовностям символів (текстові дані), які можна представити у лапках (одинарних або подвійних).
 - Boolean (Булевий): Відповідає двом можливим значенням: true (істина) або false (хиба). Використовується для логічних операцій.
 - Object (Об'єкт): Відповідає складним даним, які можуть містити властивості та методи.
 Об'єкти є основними елементами ООП (об'єктно-орієнтованого програмування).
 - Null (Порожність): Вказує на відсутність значення або відсутність посилання на об'єкт.
 - Undefined (Не визначено): Відповідає змінним, які не були ініціалізовані та не мають значення.
 - Symbol (Символ): Введений у ECMAScript 6, символи представляють унікальні ідентифікатори та використовуються,
 зокрема, для властивостей об'єктів.
 - BigInt (Велике ціле число): Введений у ECMAScript 11, цей тип даних дозволяє працювати з цілими числами,
 які перевищують максимальні обмеження типу Number.
 */

// Number
/*let  n=12; //Це number
let float=12.345; //І це також Number
let number = 0x2a; // шістнадцятирічна система
console.log(n);
console.log(float);
console.log(number)*/

// Infinity
/*let infinity = 10/0;
console.log(infinity) // Infinity
var negativeInfinity = -10/0;
console.log(negativeInfinity) // -Infinity*/

//Nan. Значення Nan не дорівнює нічому, включаючи себе. Будь які операції з Nan повертають Nan
/*let nan = 0/0;
console.log(nan)
let nan2 = "qwerty" * 25;
console.log(nan2)*/


// String
/*
let str = "Ми вже так 100 разів робили";
console.log(str);
let str2 = 'QA pro'; // Зверніть увагу, лапки одинарні, і це цілком собі законно та не має ніякої різниці між ""
console.log(str2);
*/

// Boolean. Цей тип даних має тільки два значення true/false
/*let bool = true;
console.log(bool);*/

// Object. Про цей тип даних буде ми поговоримо на наступних уроках.
/*
let user = {
    name : "Alex",
    email: "qapro@gmail.com"
}*/

// Undefined
/*let text; // За замовчуванням якщо змінна не ініціалізована, її значення Undefined
console.log(text)
var number = undefined // Самі можемо вказати
console.log(number);*/

//Null
/*
let empty = null;
console.log(empty)*/

// Symbol. Новий тип, створений для унікальних ідентифікаторів в обєктах. Символи з однаковим імям не дорівнюють один одному.
/*let symbol = Symbol("Alex");
let symbol2 = Symbol("Alex");
console.log(symbol === symbol2)
*/

//BigInt. Цей тип даних надає змогу створювати цілі числа більш ніж 2 в 53
/*let bigInt = BigInt(8888999999881124);
let bigInt2 = 8888999999881124n;
console.log(typeof bigInt2);*/

//Динамічна типізація - за межею добра і зла.
//одна й та змінна може бути будь-ким
/*
let guessWho = 3.14;
guessWho = 'А тепер тут строка';
guessWho = false;
*/

// А як нам дізнатися якого типу яка змінна ? На допомогу приходить Nan
/*console.log(typeof "Hello");
console.log(typeof 41);
console.log(typeof false);
console.log(typeof undefined);
console.log(typeof {}); // Хто пропустив, це обьєкт, але без значень
console.log(typeof BigInt(1));
console.log(typeof null); // Це офіційна помилка самої мови програмування.*/
