"use strict"

//Оператори***************************
/**
 У програмуванні оператор - це символ або ключове слово, яке вказує комп'ютеру виконати певну дію або операцію над даними.
 Оператори використовуються для маніпулювання значеннями змінних, виконання математичних операцій, порівняння значень,
 управління потоком виконання програми та багато іншого.
 Операнд - це термін, який використовується в програмуванні та математиці для позначення значень чи об'єктів,
 над якими виконується операція.
 У контексті операторів, які виконують різні дії, операнди є значеннями, до яких ці операції застосовуються.
 Тобто 4 + 3 оператор плюс(+) з лівим та правим операндами.
 */
//  Оператор є унарним, якщо він має один операнд. Наприклад, унарне заперечення - змінює знак числа:
// Унарний мінус
/*let number = 12;
number = -number;
console.log(number); // було застосоване унарне заперечення*/


// Бінарний мінус
/*
let number = 7;
let number2 = 3;
let number3 = number - number2;
console.log(number3);
*/

// Арифметичні операції
/**
 - Додавання (+)
 - Віднімання (-)
 - Поділ (/)
 - Множення (*)
 - Залишок від поділу (%)
 - зведення в ступінь (**)
 - Інкремент (++)
 - Декремент (--)
 - Унарний плюс (+)
 - Унарний мінус (-)
 */

// Додавання (+)
/*
let num = 5 + 4;
console.log(num) // Тут все просто
*/

// А що буде якщо я спробую додати не тільки числа
/*let result = true + 10;
console.log(result) // І що ми отримаємо ?
let boolResult = true + false;
console.log(boolResult);*/

//Або давайте спробуємо множення. Js завжди намагається привести все до числа.
/*let result = true * 5;
console.log(result)*/

/*let result = "55" - 5;
console.log(result);*/

// Але + не завжди вам просто додавання. Що трапиться якщо я спробую додати строку ? Конкатенація!
/*let result = "qwerty" + 25;
console.log(result);*/

/*let a = '11';
let b = 23;
let c = a + b;
console.log(c); // І що ми отримаємо ?*/

/*let result = "API tester cool:" + true;
console.log(result)*/

/*let messageOwner = "Oleg";
let message = "Hello I'm message from " + messageOwner; // Ну тут все просто!
console.log(message);*/

//Побічний ефект: унарний '+' - завжди призводить до числа!
/*let a = '55';
console.log(typeof a);
console.log(typeof +a);
console.log(typeof a); // сюрприз?*/

/*let b = +true;
console.log(b)*/

/*let c = +null;
console.log(c);*/

// Ну і знов доречно згадати про Nan
/*let result = "Hello" * 5;
console.log(result)*/

//Залишок від поділу (%)
/*console.log(12 % 6);
console.log(12 % 5);
console.log(4 % 3);
console.log(-4 % 3);
console.log(-6 % 2);
console.log(NaN % 2);*/

//Зведення в ступінь (**). Перед тим як розібратися у зведенні в ступінь, давайте розглянемо:
/**
 Правоасоціативні та лівоасоціативні оператори - це терміни,
 які використовуються для опису напрямку асоціації (групування) операторів з однаковим пріоритетом у виразах.
 Ці терміни особливо важливі при виразах з однаковими або різними операторами, які мають однаковий пріоритет.
 */

//Приклад лівоасоціативної операції
//var a = 5 + 6 + 7;

//Приклад правоасоціативної операції. Це одна з операцій присвоєння
/*var a = 5;
var b = 6;
var c = a = b;
console.log(c) // ??? */

// Повернемося до зведення в ступінь
/*console.log(2 ** 3);
console.log(2 ** 3 ** 2); // Ось в такому випадку виконується правоасоціативна операція
console.log(-2 ** 2); // Так не підходить
console.log(-(2 ** 2));
console.log((-2) ** 2);*/

//Інкремент/Декремент постфіксний
/*var a = 1;
console.log(a++);
console.log(a);
var b = 2;
console.log(b--);
console.log(b)*/

//Інкремент/Декремент префіксний
/*
var b=1;
console.log(++b);
console.log(b);
var b = 2;
console.log(--b);
console.log(b)
*/

// Операції присвоювання
/**
 - Присвоєння
 - Присвоєння з додаванням
 - Присвоєння з відніманням
 - Присвоєння з множенням
 - Присвоєння з розподілом
 - Присвоэння по модулю
 */

// Присвоєння
/*
var a = 5;
var b = 10;
var c = b;
c = a = b;
console.log(c);*/

//Присвоєння з додаванням
/*var number = 15;
number +=10; // Це так само як number = number + 10;
console.log(number)

var result = true;
result +=true;
console.log(result)*/

//Присвоєння з відніманням
/*var number = 5;
number -=5;
console.log(number);*/

//Присвоєння з множенням
/*var number = 20;
number *= 2;
console.log(number);*/

//Присвоєння з розподілом
/*var number = 20;
number /= 2;
console.log(number);*/

//Присвоэння по модулю
/*var number = 20;
number %= 2;
console.log(number);*/

// Операції порівняння
/**
 У JavaScript існують різноманітні оператори порівняння,
 які дозволяють порівнювати значення та здійснювати логічні порівняння між ними. Ось декілька основних операторів порівняння:
 - Оператор рівності (==)
 - Оператор нерівності (!=)
 - Оператор строгої рівності (===)
 - Оператор строгої нерівності (!==)
 - Оператор більше (>)
 - Оператор менше (<)
 - Оператор більше або рівно (>=)
 - Оператор менше або рівно (<=)
 Завжди приводяться до false
 - null
 - NaN
 - 0
 - '' пуста строка
 - undefined
 Все інше true!
 Js завжди намагається привести все до числа.
 */


//!!!! Оператор рівності (==) - Порівнює два значення на рівність (за значенням),
// і повертає true, якщо вони рівні, і false - якщо нерівні. """"Застосовує автоматичне приведення типів.""""
/*console.log('2' == 1);
console.log('001'== 1);
console.log(true == 1);
console.log(false == 1);
*/

// Оператор строгої рівності (===): порівнює два значення на рівність як за значенням, так і за типом даних.
// Повертає true, якщо значення рівні і мають однаковий тип, і false - якщо вони різні.
/*console.log(0 === false);
console.log('' === false);
console.log('' === 0);
console.log(2 === 2);*/

// Оператор нерівності (!=)  Порівнює два значення на нерівність, і повертає true, якщо вони не рівні, і false - якщо рівні.
// Застосовує автоматичне приведення типів.
/*console.log(11 != 11);
console.log(1 != true)
console.log('' != false)*/

// Оператор строгої нерівності (!==): Порівнює два значення на нерівність як за значенням, так і за типом даних.
// Повертає true, якщо значення різні або мають різний тип, і false - якщо вони рівні і мають однаковий тип.
/*console.log(21 !== '21');
console.log(false !== 0);
console.log(23 !== 20);*/

//  Оператор більше (>), Оператор менше (<), Оператор більше або рівно (>=), Оператор менше або рівно (<=).
// Нічого не звичайного!
/*console.log(5 > 2);
console.log(false > true);
console.log(true > 0)*/

//Делікатна тема – порівняння рядків.
/*console.log('a'>'b');
console.log('a'>'A'); // малі літери "більше" великих
console.log('A'>'1'); // великі "більше" цифр
console.log('1'>'$'); // цифри "більше" спецсимволів*/
// Все набагато простіше, яка літера стоїть раніше у таблиці unicode(http://xn--80adth0aefm3i.xn--j1amh/%D1%82%D0%B0%D0%B1%D0%BB%D0%B8%D1%86%D1%8F-unicode), та і буде меншою, яка пізніше більшою.

//Порівняння рядків більше ніж з одного символу - як у телефонній книзі.
/*
console.log('Ба'>'Аяяяяяяяяяя'); // На першій літері переможець
console.log('ваня'>'вася');
console.log('Привіт'>'Прив'); //І тільки якщо всі букви рівні - перемагає той, хто довший
*/

// Дуже особливий випадок: null та undefined
/*var undef;
var n = null;
console.log(undef == null); //Просто так вирішили. undefined і null рівні один одному і НІ ЩО БІЛЬШЕ!
console.log(n == null);
console.log(undef == undefined);*/

// Приведемо ці значення до number
/*console.log('null as number: '+(+null) );
console.log('undefined as number: '+(+undefined) );*/

//І ще одна мила особливість: NaN не дорівнює взагалі нічого, навіть собі самому
/*var a = "Hello" * 3; //Дасть у результаті типовий NaN
console.log('a=' + a);
console.log('a === NaN? ' + (a === NaN));
console.log('a == NaN? ' + (a == NaN));
console.log('a > NaN ' + (a > NaN));
console.log('a < NaN ' + (a < NaN));*/

// Але як нам дізнатися, а чи не вийшов у нас NaN в результаті якоїсь операції?!
/*var a = "Hello" * 3;
console.log('are "a" equal NaN? ' + isNaN(a));*/

/**
 У JavaScript булеві оператори використовуються для логічних операцій над булевими значеннями (true або false).
 Ось деякі з основних булевих операторів в JavaScript:
 Логічний оператор "І" (AND):
 && - повертає true, якщо обидва операнди є true, інакше повертає false.
 Логічний оператор "АБО" (OR):
 || - повертає true, якщо хоча б один з операндів є true, інакше повертає false.
 Логічний оператор "НІ" (NOT):
 ! - інвертує булеве значення. Наприклад, !true поверне false, а !false поверне true.
 Все перетворюється на boolean.
 При цьому 0, '', null, undefined, NaN => все перетворюється на false

 */

// У оператора "і" ("and") теж короткий цикл - обчислення припиняються, як тільки знаходимо false
/*let salary = 1000;
let age = 17;
let isMarried = true;
let bonus = salary && age && isMarried;
console.log(bonus);*/

//Але якщо ми все ж таки дійшли до кінця - повертається останнє обчислене значення
/*let salary = 1000;
let age = 17;
let isMarried = false;
let bonus = salary && age && isMarried;
console.log(bonus);*/

//Короткий цикл перевірки "або" - виходимо, як тільки знайшли хоч один true
/*
let salary;
let age = 17;
let isMarried = false;
let bonus = salary || age || isMarried;*/
//console.log(bonus);

// ! - інвертує булеве значення.
/*let isStudent = true;
let isMarried = true;
let isHasChild = true;
let isNeedExtraMoney = isStudent && isMarried && isHasChild;*/
//console.log(isNeedExtraMoney)
//console.log(!isNeedExtraMoney)

// Інший приклад
/*
console.log(!1);
console.log(!"qwerty");
console.log(!false);
console.log(!null);
console.log(!"");*/
